src/Catalogs/рнсПравилаОписанияВстроенныхДокументов/рнсПравилаОписанияВстроенныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсПравилаОписанияВстроенныхДокументов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШаблона</name>
    <comment>0 - табличный документ, 1 - макет, 2 - форматированный документ, 3 - текстовый документ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Области</name>
    <attributes>
      <name>ИмяОбласти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсПравилаОписанияВстроенныхДокументов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                	
	ПравилоОбъект 	= РеквизитФормыВЗначение("Объект");  	
	Данные 			= ПравилоОбъект.Хранилище.Получить();  
	
	Если Данные <> Неопределено Тогда 
		Если Объект.ТипШаблона = 0 Тогда
			ДокументТабличный 			= Данные;	
		ИначеЕсли Объект.ТипШаблона = 1 Тогда 
			ДокументТабличный.Макет 	= Истина;
			ДокументТабличный 			= Данные;
		ИначеЕсли Объект.ТипШаблона = 2 Тогда 
			ДокументФорматированный 	= Данные;
		ИначеЕсли Объект.ТипШаблона = 3 Тогда 
			ДокументТекстовый 			= Данные;
		КонецЕсли; 				 			
	КонецЕсли; 	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекущуюСтраницу();		
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ТипШаблона = 0 Тогда
		Значение = ДокументТабличный;	
	ИначеЕсли Объект.ТипШаблона = 1 Тогда 
		Значение = ДокументТабличный;  		
	ИначеЕсли Объект.ТипШаблона = 2 Тогда 
		Значение = ДокументФорматированный;
	ИначеЕсли Объект.ТипШаблона = 3 Тогда 
		Значение = ДокументТекстовый;
	КонецЕсли; 
	
	ТекущийОбъект.Хранилище = Новый ХранилищеЗначения(Значение); 
	
КонецПроцедуры    

#КонецОбласти 

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ТипШаблонаПриИзменении(Элемент)
	     	
	УстановитьТекущуюСтраницу();
	ИзменениеТабличногоДокументаНаСервере();
	        	
КонецПроцедуры

&НаКлиенте
Процедура ОбластиПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Области.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Элементы.Параметры.ОтборСтрок = Неопределено;	
	Иначе
		Элементы.Параметры.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСвязи", ТекущаяСтрока.КлючСвязи);	
	КонецЕсли;    		
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции   

&НаСервере
Процедура ИзменениеТабличногоДокументаНаСервере()
	
	Если Объект.ТипШаблона = 0 Тогда
		ДокументТабличный.Макет = Ложь;
	ИначеЕсли Объект.ТипШаблона = 1 Тогда
		ДокументТабличный.Макет = Истина;
	КонецЕсли;  		
	
КонецПроцедуры   

&НаКлиенте
Процедура УстановитьТекущуюСтраницу()
	
	Если Объект.ТипШаблона = 0 Тогда
		ТекущаяСтраница = Элементы.СтраницаТабличныйДокумент;		
	ИначеЕсли Объект.ТипШаблона = 1 Тогда 
		ТекущаяСтраница = Элементы.СтраницаТабличныйДокумент; 		
	ИначеЕсли Объект.ТипШаблона = 2 Тогда 
		ТекущаяСтраница = Элементы.СтраницаФорматированныйДокумент;
	ИначеЕсли Объект.ТипШаблона = 3 Тогда 
		ТекущаяСтраница = Элементы.СтраницаТекстовыйДокумент;
	КонецЕсли;
	
	Для каждого Ит Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Ит.Видимость = Ложь;	
	КонецЦикла; 	
	
	Элементы.СтраницаОсновное.Видимость = Истина;
	ТекущаяСтраница.Видимость 			= Истина;
	Элементы.Страницы.ТекущаяСтраница 	= ТекущаяСтраница;
	
КонецПроцедуры
 
#КонецОбласти
